//Домашняя работа после второго семинара.
// Задача 10. Показать вторую цифру трехзначного числа
/*void ShowSecond()
{
    int num = new Random().Next(100, 999);
    int firstNum = num / 10;
    int secondNum = firstNum % 10;
    Console.Write(num + "->");
    Console.Write(secondNum);
    }
Console.WriteLine("Задача 10. Показать второе число.");
ShowSecond();*/
// Задача 11. Вывести третью цифру и сообщить, что её нет.
/*void ShowThird(int numbers)
{
    int length = numbers.Length;
    if (length>=3)
    {
        Console.WriteLine(numbers[2]);
    }
    else
    {
        Console.WriteLine("Третьей цифры нет");
    }
       }
Console.WriteLine("Задача 13. Показать третье число.");
Console.WriteLine("Введите целое число: ");
int num = Convert.ToInt32(Console.ReadLine());
ShowThird(num);*/

/*string ShowThird(string[] numbers)
{
    int length = numbers.Length;
    if (length>=3)
    {
        Console.WriteLine(numbers[2]);
    }
    else
    {
        Console.WriteLine("Третьей цифры нет");
    }
}
Console.WriteLine("Задача 13. Показать третье число.");
Console.WriteLine("Введите целое число: ");
string num = Console.ReadLine();
ShowThird(num);*/



